#python智能猜数（整数）代码（3种逻辑体系）Demo（人工智障，emmm）

#初始化（不完全参数初始化）
import time	#引入time库提供暂停
import random	#引入random库提供随机数
错误值=0	#初始化错误值
许可=1		#初始化许可
循环条件=1	#初始化循环条件
初始值=1	#提供判断初始
次数=0		#计数器重置
借口=1		#猜错反馈语句切换

#程序智能控制（可以多次训练，选择适当配置）
理性=500		#平均值性
任性=700		#随机数性
感性=200		#基于所猜数增减1性

#程序智能控制的数据算法
if 任性>=0 and 理性>=0 and 感性>=0:
    总意识值=理性+任性+感性
    意识值=random.randint(1,总意识值)
    理性边界=理性
    任性边界=理性边界+任性
    感性边界=任性边界+感性
    感性赋值依赖=1
else:
    print("智能判断参数错误！")
    错误值=3

print("欢迎进入智能猜数（整数）Demo!")
print("使用方法：输入猜值定义域后输入Python要猜的数。")
print("--------------------------------------------------------------------------")
time.sleep(1)
起始端=int(input("请输入定义域起始端："))
终止端=int(input("请输入定义域终止端："))
if 起始端<终止端:
    最小=起始端
    最大=终止端
elif 起始端>终止端:
    最小=终止端
    最大=起始端
elif 起始端==终止端:
    print("您输入的是一个点！请重新启动。")
    print("纠错系统猜：",起始端,"是您想输入的值。")
    错误值=1
    许可=0
if 许可!=0:
    所猜数=int(input("请输入Python要猜的数："))
    if 所猜数>最大 or 所猜数<最小:
        print("您输入的是一个超值域的数！请重新启动。")
        print("纠错系统猜：",所猜数,"是您想输入的值。")
        print("纠错系统猜：你这样输入，程序不会猜中，已经纠错！")
        错误值=2
print("--------------------------------------------------------------------------")
time.sleep(1)
if 许可==0 or 错误值>0:
    循环条件=0
while 循环条件==1:
    if 意识值<=理性边界 and 意识值>0:
        平均值=(最大+最小)/2
        猜=int(平均值)
    elif 意识值<=任性边界 and 意识值>理性边界:
        猜=random.randint(最小,最大)
    elif 意识值<=感性边界 and 意识值>任性边界:
        if 感性赋值依赖==1:
            猜=最小+1
        elif 感性赋值依赖==-1:
            猜=最大-1
    if 猜<所猜数:
        比较反馈值=1
    elif 猜>所猜数:
        比较反馈值=-1
    elif 猜==所猜数:
        比较反馈值=0
        循环条件=0
    if 初始值==1 and 借口==1:
        初始值=0
        print("那我就开始猜了！我猜：",猜)
    elif 借口==2 and 感性赋值依赖!=0:
        print("什么？不对？那我猜：",猜)
    elif 借口==3 and 感性赋值依赖!=0:
        if 感性赋值依赖==-1:
            print("猜大了？好吧，那我猜：",猜)
        if 感性赋值依赖==1:
            print("猜小了？好吧，那我猜：",猜)
    elif 借口==4 and 感性赋值依赖!=0:
        print("吼！吼！那一定在：",最小,",",最大,"之间。")
        print("那我猜：",猜)
    elif 感性赋值依赖==0:
        print("出现错误！请检查代码是否跳出循环。")
    time.sleep(1)
    if 比较反馈值==1:
        print("用户（由纠错程序发送）：你猜小了。")
        最小=猜+1        #去除边界
    elif 比较反馈值==-1:
        print("用户（由纠错程序发送）：你猜大了。")
        最大=猜-1        #去除边界
    elif 比较反馈值==0:
        print("用户（由纠错程序发送）：你猜对了。")
        最小=猜
        最大=猜
        循环条件=0
    感性赋值依赖=比较反馈值
    意识值=random.randint(1,总意识值)
    借口=random.randint(2,4)          #为了不让回复单一
    次数+=1
    time.sleep(1)
print("运行结束。")
print("以下区块是日志。")
print("--------------------------------------------------------------------------")
time.sleep(1)
print("理性值：",理性)
print("任性值：",任性)
print("感性值：",感性)
print("所猜数：",所猜数)
print("所猜次数：",次数)
print("定义域：[",最小,",",最大,"]")
print("错误值记录：",错误值)
print("（注意，错误值0表示没有错误，默认只显示最近一个错误。）")
print("--------------------------------------------------------------------------")
print("20秒后退出。")
time.sleep(20)
exit()
